demo2/demo2B/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
12556
(
(99.9993 0.00196342 -1.51317e-19)
(99.999 0.00677963 5.10098e-24)
(99.998 0.0147614 -1.60747e-19)
(99.9966 0.0272315 -1.57512e-19)
(100 0.0212759 6.49509e-20)
(99.9984 0.0365082 0)
(99.9975 0.0593311 0)
(99.9967 0.0917983 -1.12555e-19)
...
)
;

boundaryField
{
    topAndBottom
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (100 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector> 
62
(
(106.346 -0.0590817 0)
(106.328 -0.177178 0)
(106.284 -0.29106 0)
(106.203 -0.399207 0)
(93.7139 -0.377697 0)
(93.5516 -0.275181 0)
(93.4479 -0.167489 0)
(93.3986 -0.0558483 0)
...
)
;
    }
    wing
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
