demo2/demo2B/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
12556
(
36.829
36.8288
36.8289
36.8308
36.9166
36.9183
36.9196
36.9223
...
)
;

boundaryField
{
    topAndBottom
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 37;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 37;
        value           nonuniform List<scalar> 
62
(
31.8986
31.9292
32.003
32.145
32.431
32.137
31.9612
31.881
...
)
;
    }
    wing
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
378
(
58.5201
40.2266
40.1436
52.666
97.6682
68.544
52.819
57.2681
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
